# 데이터 베이스
- 규모가 크지 않은 데이터라면 csv와 json형식으로 사용해도 문제는 없음.
- 데이터 규모가 굉장히 크거나 복잡하면 데이터제이스를 사용하는 것이 편리.

### 장점
- 데이터와 관련된 모든 처리를 하나의 소프트웨어로 할 수 있음.
- 여러 데이터의 속성을 연관시키며 저장 가능.
- 중복된 데이터를 허용하지 않는제약을 둘 수있음.
- 데이터의 정합성을 확보
- 데이터에 동시 접근했을 경우 문제 처리
- 대량의 데이터를 조금씩 읽어 사용할 수 있으며 정렬 등도 쉽게 처리함

# SQLite
: 가볍게 파일 하나로 사용할 수 있는 데이터베이스

In [29]:
import sqlite3

#sqlite Database에 연결하기
dbPath ="../Data/test.sqlite"
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기

curs = conn.cursor()
curs.executescript(
    """
    /* item 테이블이 이미 있다면 제거 */
    DROP TABLE IF EXISTS items;

    /*테이블 생성하기*/
    CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );

    /* 데이터 넣기 */
    INSERT INTO items(name, price) VALUES('Apple', 800);
    INSERT INTO items(name, price) VALUES('Orange', 780);
    INSERT INTO items(name, price) VALUES('Banana', 430);
    """
)

In [30]:
# 위의 조작을 데이터베이스에 반영하기
conn.commit()

In [31]:
# 데이터 추가하기
curs = conn.cursor()
curs.execute("SELECT item_id, name, price FROM items")
item_list = curs.fetchall()

for it in item_list:
    print(it)

(1, 'Apple', 800)
(2, 'Orange', 780)
(3, 'Banana', 430)

In [32]:
# 데이터 넣기
curs = conn.cursor()
curs.execute("INSERT INTO items (name, price) VALUES (?,?)", ("Mango", 5200))
conn.commit()

In [33]:
# 여러 데이터를 연속으로 넣기
curs = conn.cursor()
data = [("Kiwi",4000),("Grape",8000),("Peach", 9400)]
curs.executemany("INSERT INTO items (name, price) VALUES (?,?)", data)
conn.commit()

In [35]:
# 4000 - 7000원 사이의 데이터 추출하기

curs = conn.cursor()
price_range = (4000, 7000)
curs.execute("SELECT * FROM items WHERE price between ? AND ?", price_range)
item_list = curs.fetchall()

#출력하기
for it in item_list:
    print(it)

(4, 'Mango', 5200)
(5, 'Kiwi', 4000)

---
# MySQL연결

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 5.3 MB/s  eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import pymysql

In [6]:
# Connection
conn = pymysql.connect(host="127.0.0.1", user="root", password="qwer1234", \
                        db = "education", charset="utf8" )

In [7]:
# Connection으로부터 Curcor 생성
curs = conn.cursor()

In [8]:
# sql문장
sql = "select * from student"
curs.execute(sql)

16

In [9]:
# Data Fetch
rows = curs.fetchall()
print(rows)

(('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('d001', '홍길동', '수학과', '017-001', '광주'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S010', 'James', 'Computer', '1234', None), ('S777', 'Cathy', 'Math', '12345', None), ('S888', 'James', 'math', '1234', None), ('S999', '홍길동', '컴공', '123', None), ('y001', '누구게?', '국문학과', '010-1111', '서울'), ('y002', '맞춰봐', '국문학과', '010-2222', '서울'), ('y003', '메렁', '국문학과', '010-3333', '서울'))

In [10]:
# Connection 종료
conn.close()

In [11]:
#list로 변환
rowList = list(rows)
print(rowList)

[('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('d001', '홍길동', '수학과', '017-001', '광주'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S010', 'James', 'Computer', '1234', None), ('S777', 'Cathy', 'Math', '12345', None), ('S888', 'James', 'math', '1234', None), ('S999', '홍길동', '컴공', '123', None), ('y001', '누구게?', '국문학과', '010-1111', '서울'), ('y002', '맞춰봐', '국문학과', '010-2222', '서울'), ('y003', '메렁', '국문학과', '010-3333', '서울')]

In [12]:
# data type 확인
type(rowList)

list

In [13]:
print(rowList[0])
print(rowList[0][1])

('b002', '관우', '심리학과', '010-222', '서울')
관우

# Insert Data #1

In [14]:
# Connection
conn = pymysql.connect(host="127.0.0.1", user="root", password="qwer1234", \
                        db = "education", charset="utf8" )

In [15]:
# Connection으로부터 Curcor 생성
curs = conn.cursor()

In [16]:
# SQL 문장
sql = "insert into student (scode, sname, sdept, sphone, saddress) values(%s,%s,%s,%s,%s)"

In [20]:
# Insert 실행
curs.execute(sql, ('z001','유비','국문학과','010-1111', '서울'))
curs.execute(sql, ('z002','관우','심리학과','010-2222', '서울'))
curs.execute(sql, ('z003','장비','경제학과','010-3333', '서울'))

1

In [21]:
conn.commit()

In [23]:
# Connection
conn = pymysql.connect(host="127.0.0.1", user="root", password="qwer1234", \
                        db = "education", charset="utf8" )

In [24]:
# Connection으로부터 Curcor 생성
curs = conn.cursor()

In [25]:
data = (
    ('w001','조조','국문학과','016-111','경기'),
    ('w002','여포','심리학과','016-222','경기'),
    ('w003','장비','경제학과','016-333','경기'),
)

In [26]:
# SQL 문장
sql = "insert into student (scode, sname, sdept, sphone, saddress) values (%s,%s,%s,%s,%s)"

In [27]:
# Insert 실행
curs.executemany(sql, data)

3

In [28]:
conn.commit()

---
### select의 내용을 dataFrame으로 보기

In [36]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (1.4.22)
Requirement already satisfied: greenlet!=0.4.17 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)

In [37]:
import pandas as pd
from sqlalchemy import create_engine

In [39]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education")
conn = engine.connect()

In [40]:
data = pd.read_sql_table('student', conn)
data

   scode  sname     sdept    sphone saddress
0   b002     관우      심리학과   010-222       서울
1   b003     장비      경제학과   010-333       서울
2   c002     여포      심리학과   016-222       경기
3   c003     손견      경제학과   016-333       경기
4   d001    홍길동       수학과   017-001       광주
5   q001     유비      국문학과  010-1111       서울
6   S001    박소명    컴퓨터공학과  123-4567     None
7   S002    최민국    컴퓨터공학과  234-5678     None
8   S005    김상진       사학과  567-8901     None
9   S006    황정숙       사학과  678-9012     None
10  S010  James  Computer      1234     None
11  S777  Cathy      Math     12345     None
12  S888  James      math      1234     None
13  S999    홍길동        컴공       123     None
14  w001     조조      국문학과   016-111       경기
15  w002     여포      심리학과   016-222       경기
16  w003     장비      경제학과   016-333       경기
17  y001   누구게?      국문학과  010-1111       서울
18  y002    맞춰봐      국문학과  010-2222       서울
19  y003     메렁      국문학과  010-3333       서울
20  z001     유비      국문학과  010-1111       서울
21  z002     관우      심리학과  010-2222       서울
22  z003     장비      경제학과  010-3333       서울

In [41]:
conn.close()

---
### dataFrame을 Database로 Insert하기

In [43]:
column = ['rank','title']
movies = pd.read_csv("../Data/DaumList.csv")
movies.columns =column
movies.head()

   rank                        title
0     1                      탑건: 매버릭
1     2  마녀(魔女) Part2. The Other One
2     3                       범죄도시 2
3     4                          브로커
4     5                     버즈 라이트이어

In [44]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum")
conn = engine.connect()

In [ ]:
# - 데이터 프레임 movies
# - sql table movie
# - sql 스키마 daum

In [45]:
movies.to_sql(name='movie', con=engine, if_exists='append', index=False)

In [46]:
daum = pd.read_sql_table('movie', conn)
daum

    rank                           title
0      1                         탑건: 매버릭
1      2     마녀(魔女) Part2. The Other One
2      3                          범죄도시 2
3      4                             브로커
4      5                        버즈 라이트이어
5      6                    쥬라기 월드: 도미니언
6      7           극장판 윌벤져스 : 수상한 캠핑 대소동
7      8  극장판 포켓몬스터DP: 기라티나와 하늘의 꽃다발 쉐이미
8      9                          헤어질 결심
9     10                           룸 쉐어링
10    11                  니 부모 얼굴이 보고 싶다
11    12                          로스트 시티
12    13                              모어
13    14                             니얼굴
14    15                           애프터 양
15    16                               홈
16    17                              랭킹
17    18                           상영예정작
18    19                             콘텐츠